Tekla Open API Reference for Tekla Structures 2025
ClipPlane.Location Property
The clip plane location in global coordinates (XYZ).
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Location { get; set; }
Public Property Location As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace